package com.tencent.BianLiang;
/**
 * 课程目标：
 * 1、为什么需要变量。
 * 2、变量的声明和使用。
 * 3、标识符命名规则。
 * 
 * 算法 + 数据 = 程序
 * 程序的概念：指令的集合
 * 
 * 为什么需要变量：
 * 1、内存就像存储柜，用来存放各种类型的东西（数据）。
 * 2、对程序员来说，数据存入内存只是第一步，还要考虑：1、怎样找到存入的数据。2、存入的数据能否修改。
 * 3、写程序就是在做内存存取，先把数据存入内存，需要的时候取出来做处理。
 * 4、内存地址不好记，怎么办：1、为特定的内存起个别名，通过别名找到存储的数据。2、该别名就是变量名。3、变量就是数据存储空间的表示。
 *
 * 变量的声明和使用：
 * 1、声明和使用变量的步骤：
 * 第一步：声明一个变量以分配空间（根据类型开辟空间）
 * 第二步：为变量赋值（将数据存入空间）
 * 第三步：使用变量（取出数据，使用）
 *  
 * 标识符命名规则：
 * 变量名 = 首字符 + 其余部分
 * 1、首字符：字母、下划线、$符号
 * 2、其余部分：数字、字母、下划线、$
 * 变量名：
 * 1、应避开关键字。
 * 2、符合驼峰命名法。
 * 3、若名字由多个单词组成，从第二个单词开始，首字母均大写。
 * 4、简单明了表示变量的作用，首字母小写。
 * 
 * Java 关键字（保留字）
 * 1、Java 语言有 51 个关键字，不能使用保留关键字来命名类，方法或变量。
 * 2、数据类型：boolean int long short byte flout double char class interface
 *
 */
public class test {

	public static void main(String[] args) {
	

	}

}
